api/modules/v1/models/Antrenori.php

INSERT INTO `user` (`email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('radumrn3@gmail.com', '$2y$13$C3yKpKtndzbQ6VNKIUi/3uYMoVb.0mBOY6TWdhF7ly26eUxKX6jdu', 'Tu5lKgrpi7ODmBamfY2vQ0jIFhZ9DHJW', 10, 1574360745, 1574360745)
INSERT INTO `auth_assignment` (`item_name`, `user_id`, `created_at`) VALUES ('antrenor', '15', 1574360745)
---
    public function save($runValidation = true, $attributeNames = null) {
        $newRecord = $this->isNewRecord;
        $transaction= \Yii::$app->db->beginTransaction();
        $user = new \common\models\User();
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->status = \common\models\User::STATUS_ACTIVE;
        $result = $user->save();
        if($result){
            $this->user = $user->id;
        }
        else{
            $this->addError($user->errors);
        }
        $result = $result && parent::save($runValidation, $attributeNames);
        if ($newRecord && $result) {
            $authAssignment = new \backend\models\AuthAssignment(
                    ['item_name' => \backend\models\AuthItem::ROL_ANTRENOR,
                'user_id' => strval($user->id), 'created_at' => time()]);
            if(!$authAssignment->save()) {