api/modules/v1/models/Config.php

SELECT * FROM `niveluri`
SELECT * FROM `stari_sanatate`
SELECT * FROM `judete`
SELECT * FROM `tip_antrenament`
---
    public function init() {
        parent::init();
        $this->niveluri= \backend\models\Niveluri::find()->all();
        $this->stariSanatate= \backend\models\StariSanatate::find()->all();
        $this->judete= \backend\models\Judete::find()->all();
        $this->tipAntrenament= \backend\models\TipAntrenament::find()->all();