api/modules/v1/models/Users.php

SELECT * FROM `user` WHERE `email`='stefan.iordache2001@gmail.com'
---
    public function login($email, $password) {
        $user = static::findOne(['email' => $email]);