api/modules/v1/models/Users.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`email`='balea_cata@yahoo.com')
SELECT * FROM `user` WHERE `email`='admin@cec.ro'
---
    public function login($email, $password) {
        $user = static::findOne(['email' => $email]);

INSERT INTO `user` (`email`, `status`, `created_at`, `updated_at`, `password_hash`, `auth_key`) VALUES ('balea_cata@yahoo.com', 10, 1574957758, 1574957758, '$2y$13$CjTBlfKjMfhmVJhkUnTUKejz8PBPHU/k5JQp3OwfaIwsaAnhnwFqK', 'ustmgg35x_lnRcJwpWTUHGxijPMp0aYx')
INSERT INTO `auth_assignment` (`item_name`, `user_id`, `created_at`) VALUES ('antrenor', '23', 1582899587)
---
    public function save($runValidation = true, $attributeNames = null) {
        $newRecord = $this->isNewRecord;
        $transaction = \Yii::$app->db->beginTransaction();
        $result = true;
        if ($newRecord) {
            $result = $result && parent::save($runValidation, $attributeNames);
        }
       // var_dump($this->type);
        if ($newRecord && $result) {
            $authAsignment = new AuthAssignment(['item_name' => $this->type,
                'user_id' => strval($this->id), 'created_at' => time()]);
            if (!$authAsignment->save()) {