common/models/User.php

SELECT * FROM `user` WHERE (`auth_key`='Vt1ajzxOUv7U09DNC9Nqzz5QopANINr-') AND (`status`=10)
---
    public static function findIdentityByAccessToken($token, $type = null) {
        return static::findOne(['auth_key' => $token, 'status' => self::STATUS_ACTIVE]);