backend/models/Antrenori.php

    public function save($runValidation = true, $attributeNames = null) {
        $newRecord = $this->isNewRecord;
        $transaction = \Yii::$app->db->beginTransaction();
        $user = null;
        $result = true;
        if ($newRecord) {
            $user = new \common\models\User();
            $user->email = $this->email;
            $user->setPassword($this->password);
            $user->generateAuthKey();
            $user->status = \common\models\User::STATUS_ACTIVE;
            $result = $result && $user->save();
---
INSERT INTO `user` (`email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('radumrn3@gmail.com', '$2y$13$SpN1O8pzjTRG8s2JEbvCyutbfcSzDxD3EZi0MwimehPXtTm/8pZWy', 'vUEyRHH2twy_I1gDkGRtzvKa_Ikp7DKQ', 10, 1574368036, 1574368036)