backend/models/Sportivi.php

    public function save($runValidation = true, $attributeNames = null) {
        $newRecord = $this->isNewRecord;
        $transaction= \Yii::$app->db->beginTransaction();
        $result = parent::save($runValidation, $attributeNames);
        if ($newRecord) {
            $antrenoriSportivi = new AntrenoriSportivi(['antrenor' => \Yii::$app->user->id,
                'sportiv' => $this->id]);
            $result = $antrenoriSportivi->save();
---
INSERT INTO `sportivi` (`nume`, `prenume`, `data_nastere`, `nivel`, `email`, `greutate`, `inaltime`, `stare_sanatate`, `numar_telefon`, `localitate`, `sex`) VALUES ('Radu1', 'Gheorghe1', '2001-10-12', 1, 'nadienmedomina1@yahoo.com', 70, 180, 1, '+0726213098', 1, 1)